app/Controllers/Noticias.php

SELECT *
FROM `noticias`
WHERE `noticias`.`deleted_at` IS NULL
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `noticias`
WHERE `noticias`.`deleted_at` IS NULL
---
        public function index() {

            $model = new NoticiasModel();
            $data = [
                'title' => 'Últimas Notícias',
                'noticias' => $model->paginate(1),