app/Controllers/Usuarios.php

INSERT INTO `usuarios` (`user`, `senha`) VALUES ('L', '81dc9bdb52d04dc20036dbd8313ed055')
---
    public function gravar() {
        $data['session'] = \Config\Services::session();

        if(!$data['session']->get('logged_in')) {
            return redirect('login');
        }
        $model = new UsuariosModel();

        $user = $this->request->getVar('user');
        $senha = $this->request->getVar('senha');
        $senhaCripto = md5($senha);
        $model->save([
            'user' => $user,
            'senha' => $senhaCripto
        ]);