app/Models/NoticiasModel.php

SELECT *
FROM `noticias`
WHERE `noticias`.`deleted_at` IS NULL
SELECT *
FROM `noticias`
WHERE `id` = '16'
AND `noticias`.`deleted_at` IS NULL
 LIMIT 1
---
     public function getNoticias ($id = false) {
        if ($id === false) {

            return $this->findAll();

        } else {

            return $this->asArray()->where(['id' => $id])->first();