app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `user` = 'Pablo'
AND `senha` = 'c9a4c91e82618d806297e3fb88bac653'
 LIMIT 1
---
        public function getUsuarios($user, $senha){


            return $this->asArray()
            ->where(['user' => $user, 'senha' => md5($senha)])
            ->first();